Revit 2027 API
DuplicateTypeNamesHandlerArgs.GetTypeIds Method
 Returns ids of the types with duplicate names.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetTypeIds()
Public Function GetTypeIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetTypeIds()
member GetTypeIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
See Also
Reference
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace